Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider
The Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider class provides the creation commands for creating a Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.Beam typed object.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.#ctor
Initializes a new instance of the Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider class.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.Beam
Gets the creation commands for creating a beam.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.Column
Gets the creation commands for creating a column.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.PadFooting
Gets the creation commands for creating a pad footing.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.Panel
Gets the creation commands for creating a panel.

Tekla.Structures.DirectManipulation.Model.CreationCommands.BeamTypeProvider.StripFooting
Gets the creation commands for creating a strip footing.